path = [] # 빈리스트를 만듦
used = [0] * 100 #내가 뽑은 숫자를 볼테니 이것을
def kfc(level):
    if level == 2: # 0, 1, 2 되면 종료함 종료조건을 설정함
        print(*path) # 끝까지 한번 가서 다 확인 해서 만들었으니 그 거 저장된거 출력해봐
        return
    for i in range(2, 3+1):
        if used[i]:
            continue
        path.append(i) # 순열저장하는 것
        used[i] = 1 # 이번 레벨에서 내가 숫자 하나 뽑았으니 다음엔 그 숫자 뽑지마 하기 위해서 즉 앞에 if 문에서 컨티뉴 되
        # 기 위해서 만들어 둠
        kfc(level+1) # -> 일단 하나 뽑았으니 다음으로 넘어가서 다음 꺼 뽑아
        path.pop() # 순열 끝가지 가서 저장 했으니 다음 거 오기 위해서 값을 제거 해줌.
        used[i] = 0 # 이것도 저장한거 하나 뽑았으니 그 사용함 표시 지워 임
kfc(0) # 여기서 레벨 제한을 2로 했을때 결과가 01, 02 ... 이런식으로 두개만 나왔어 레벨 제한을 3으로 하니 3개가나왔어 즉
#이것도 0부터 시작을 하니깐 0, 1 까지 뽑고 그다음 뽑으려고 하니 레벨이 2여서 안뽑여 나왔어
